# SQL Assignment

In [28]:
import pandas as pd
import sqlite3

from IPython.display import display, HTML

In [29]:
# Note that this is not the same db we have used in course videos, please download from this link
# https://drive.google.com/file/d/1O-1-L1DdNxEK6O6nG2jS31MbrMh-OnXM/view?usp=sharing

In [30]:
conn = sqlite3.connect("Db-IMDB-Assignment.db")

#### Overview of all tables

In [31]:
tables = pd.read_sql_query("SELECT NAME AS 'Table_Name' FROM sqlite_master WHERE type='table'",conn)
tables = tables["Table_Name"].values.tolist()

In [32]:
for table in tables:
    query = "PRAGMA TABLE_INFO({})".format(table)
    schema = pd.read_sql_query(query,conn)
    print("Schema of",table)
    display(schema)
    print("-"*100)
    print("\n")

Schema of Movie

   cid       name     type  notnull dflt_value  pk
0    0      index  INTEGER        0       None   0
1    1        MID     TEXT        0       None   0
2    2      title     TEXT        0       None   0
3    3       year     TEXT        0       None   0
4    4     rating     REAL        0       None   0
5    5  num_votes  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    CID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    LID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    LID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    CID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Person

   cid    name     type  notnull dflt_value  pk
0    0   index  INTEGER        0       None   0
1    1     PID     TEXT        0       None   0
2    2    Name     TEXT        0       None   0
3    3  Gender     TEXT        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Producer

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Director

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Cast

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------

## Useful tips:

1. the year column in 'Movie' table, will have few chracters other than numbers which you need to be preprocessed, you need to get a substring of last 4 characters, its better if you convert it as int type, ex: CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)

2. For almost all the TEXT columns we have show, please try to remove trailing spaces, you need to use TRIM() function

3. When you are doing count(coulmn) it won't consider the "NULL" values, you might need to explore other alternatives like Count(*)

## Q1 --- List all the directors who directed a 'Comedy' movie in a leap year. (You need to check that the genre is 'Comedyâ€™ and year is a leap year) Your query should return director name, the movie name, and the year.

<h4>To determine whether a year is a leap year, follow these steps:</h4>

<ul>
    <li><b>STEP-1:</b> If the year is evenly divisible by 4, go to step 2. Otherwise, go to step 5.</li>
    <li><b>STEP-2:</b> If the year is evenly divisible by 100, go to step 3. Otherwise, go to step 4.</li>
    <li><b>STEP-3:</b> If the year is evenly divisible by 400, go to step 4. Otherwise, go to step 5.</li>
    <li><b>STEP-4:</b> The year is a leap year (it has 366 days).</li>
    <li><b>STEP-5:</b> The year is not a leap year (it has 365 days).</li>
</ul>

Year 1900 is divisible by 4 and 100 but it is not divisible by 400, so it is not a leap year.

In [33]:
%%time
def grader_1(q1):
    q1_results  = pd.read_sql_query(q1,conn)
    print(q1_results.head(10))
    assert (q1_results.shape == (232,3))

query1 = "SELECT person.name , movie.title , movie.year \
          FROM person , m_director , movie , genre , m_genre \
          WHERE person.pid = m_director.pid and movie.mid = m_director.mid \
                and m_genre.mid = m_director.mid and m_genre.gid = genre.gid  \
                and  genre.name like '%Comedy%' and (CAST(SUBSTR(TRIM(movie.year),-4) AS INTEGER)%4 = 0 \
                                                     and (CAST(SUBSTR(TRIM(movie.year),-4) AS INTEGER)%100 <> 0) \
                                                     or CAST(SUBSTR(TRIM(movie.year),-4) AS INTEGER)%400 = 0 )"
grader_1(query1)

                Name                              title  year
0       Milap Zaveri                         Mastizaade  2016
1       Danny Leiner  Harold & Kumar Go to White Castle  2004
2     Anurag Kashyap                 Gangs of Wasseypur  2012
3       Frank Coraci        Around the World in 80 Days  2004
4      Griffin Dunne             The Accidental Husband  2008
5        Anurag Basu                             Barfi!  2012
6    Gurinder Chadha                  Bride & Prejudice  2004
7         Mike Judge    Beavis and Butt-Head Do America  1996
8   Tarun Mansukhani                            Dostana  2008
9       Shakun Batra                      Kapoor & Sons  2016
CPU times: user 93.4 ms, sys: 23.1 ms, total: 117 ms
Wall time: 150 ms

## Q2 --- List the names of all the actors who played in the movie 'Anand' (1971)

In [34]:
%%time
def grader_2(q2):
    q2_results  = pd.read_sql_query(q2,conn)
    print(q2_results.head(10))
    assert (q2_results.shape == (17,1))


query2 = """SELECT DISTINCT TRIM(P.NAME) AS Actor_Name
            FROM Movie M
            JOIN    M_Cast MC
            ON      M.MID = MC.MID
            JOIN    Person P
            ON      TRIM(MC.PID) = TRIM(P.PID)
            WHERE  M.title = 'Anand'"""
grader_2(query2)

         Actor_Name
0  Amitabh Bachchan
1     Rajesh Khanna
2     Sumita Sanyal
3        Ramesh Deo
4         Seema Deo
5    Asit Kumar Sen
6        Dev Kishan
7      Atam Prakash
8     Lalita Kumari
9            Savita
CPU times: user 321 ms, sys: 46.7 ms, total: 367 ms
Wall time: 389 ms

## Q3 --- List all the actors who acted in a film before 1970 and in a film after 1990. (That is: < 1970 and > 1990.)

In [35]:
%%time

def grader_3a(query_less_1970, query_more_1990):
    q3_a = pd.read_sql_query(query_less_1970,conn)
    print(q3_a.shape)
    q3_b = pd.read_sql_query(query_more_1990,conn)
    print(q3_b.shape)
    return (q3_a.shape == (4942,1)) and (q3_b.shape == (62570,1))

query_less_1970 =""" SELECT p.PID from Person p 
                     INNER JOIN (SELECT TRIM(mc.PID) PD, mc.MID 
                                 FROM M_cast mc 
                                 WHERE mc.MID 
                                 IN(SELECT mv.MID 
                                    FROM Movie mv 
                                    WHERE CAST(SUBSTR(mv.year,-4) AS Integer)<1970)) r1 on r1.PD=p.PID """


query_more_1990 =""" SELECT p.PID 
                     FROM Person p 
                     INNER JOIN(SELECT TRIM(mc.PID) PD, mc.MID 
                                FROM M_cast mc 
                                WHERE mc.MID in(SELECT mv.MID 
                                                FROM Movie mv 
                                                WHERE CAST(SUBSTR(mv.year,-4) AS Integer)>1990)) r1 on r1.PD=p.PID """
print(grader_3a(query_less_1970, query_more_1990))

# using the above two queries, you can find the answer to the given question

(4942, 1)
(62570, 1)
True
CPU times: user 309 ms, sys: 21.4 ms, total: 330 ms
Wall time: 335 ms

In [36]:
%%time
def grader_3(q3):
    q3_results  = pd.read_sql_query(q3,conn)
    print(q3_results.head(10))
    assert (q3_results.shape == (300,1))

query3 = """WITH ACTORS_BEFORE_1970 AS(SELECT DISTINCT TRIM(MC.PID) PID
                                        FROM  Movie M
                                        JOIN    M_Cast MC
                                        ON      M.MID = MC.MID
                                        WHERE  CAST(SUBSTR(M.year,-4) AS UNSIGNED) < 1970),
    ACTORS_AFTER_1990 AS(SELECT DISTINCT TRIM(MC.PID) PID
                         FROM  Movie M
                         JOIN    M_Cast MC
                         ON      M.MID = MC.MID
                         WHERE  CAST(SUBSTR(M.year,-4) AS UNSIGNED) > 1990)
    SELECT DISTINCT TRIM(P.Name) Actor_Name
    FROM ACTORS_BEFORE_1970 A_1970
        JOIN    ACTORS_AFTER_1990 A_1990
        ON      A_1970.PID = A_1990.PID
        JOIN    Person P
        ON      A_1970.PID = TRIM(P.PID)"""
grader_3(query3)

         Actor_Name
0      Rishi Kapoor
1  Amitabh Bachchan
2            Asrani
3      Zohra Sehgal
4   Parikshat Sahni
5     Rakesh Sharma
6       Sanjay Dutt
7         Ric Young
8             Yusuf
9    Suhasini Mulay
CPU times: user 478 ms, sys: 66.4 ms, total: 544 ms
Wall time: 683 ms

## Q4 --- List all directors who directed 10 movies or more, in descending order of the number of movies they directed. Return the directors' names and the number of movies each of them directed.

In [10]:
%%time

def grader_4a(query_4a):
    query_4a = pd.read_sql_query(query_4a,conn)
    print(query_4a.head(10)) 
    return (query_4a.shape == (1462,2))

query_4a ="""SELECT p.pid,count(p.pid) c 
             FROM M_Director md 
             JOIN person p on p.pid=md.pid 
             JOIN movie m on m.mid=md.mid 
             GROUP BY p.pid """
print(grader_4a(query_4a))

# using the above query, you can write the answer to the given question

         PID  c
0  nm0000180  1
1  nm0000187  1
2  nm0000229  1
3  nm0000269  1
4  nm0000386  1
5  nm0000487  2
6  nm0000965  1
7  nm0001060  1
8  nm0001162  1
9  nm0001241  1
True
CPU times: user 82.8 ms, sys: 3.31 ms, total: 86.1 ms
Wall time: 104 ms

In [37]:
%%time
def grader_4(q4):
    q4_results  = pd.read_sql_query(q4,conn)
    print(q4_results.head(10))
    assert (q4_results.shape == (58,2))

query4 = """SELECT p.name,count(p.name) c 
            FROM M_director md 
            JOIN person p on p.pid=md.PID 
            JOIN movie m on m.mid=md.mid 
            GROUP BY p.name 
            HAVING c>=10 
            ORDER BY c desc"""
grader_4(query4)

                    Name   c
0           David Dhawan  39
1           Mahesh Bhatt  36
2           Priyadarshan  30
3        Ram Gopal Varma  30
4           Vikram Bhatt  29
5   Hrishikesh Mukherjee  27
6            Yash Chopra  21
7         Shakti Samanta  19
8        Basu Chatterjee  19
9           Subhash Ghai  18
CPU times: user 81.7 ms, sys: 4.42 ms, total: 86.1 ms
Wall time: 100 ms

## Q5.a --- For each year, count the number of movies in that year that had only female actors.

In [38]:
%%time

# note that you don't need TRIM for person table

def grader_5aa(query_5aa):
    query_5aa = pd.read_sql_query(query_5aa,conn)
    print(query_5aa.head(10)) 
    return (query_5aa.shape == (8846,3))
#Write your query that will get movie id, and number of people for each geneder
query_5aa =""" SELECT trim(c.MID),p.Gender,COUNT(*) as Count
               FROM Person p
               INNER JOIN M_Cast c
               ON p.PID=trim(c.PID)
               GROUP BY trim(c.MID), p.Gender"""

print(grader_5aa(query_5aa))

def grader_5ab(query_5ab):
    query_5ab = pd.read_sql_query(query_5ab,conn)
    print(query_5ab.head(10)) 
    return (query_5ab.shape == (3469, 3))
#Write your query that will have at least one male actor try to use query that you have written above
query_5ab ="""SELECT trim(c.MID),p.Gender,COUNT(*) as Count
               FROM Person p
               INNER JOIN M_Cast c
               ON p.PID=trim(c.PID)
               WHERE p.Gender= "Male"
               GROUP BY trim(c.MID), p.Gender  """

print(grader_5ab(query_5ab))


# using the above queries, you can write the answer to the given question

  trim(c.MID)  Gender  Count
0   tt0021594    None      1
1   tt0021594  Female      3
2   tt0021594    Male      5
3   tt0026274    None      2
4   tt0026274  Female     11
5   tt0026274    Male      9
6   tt0027256    None      2
7   tt0027256  Female      5
8   tt0027256    Male      8
9   tt0028217  Female      3
True
  trim(c.MID) Gender  Count
0   tt0021594   Male      5
1   tt0026274   Male      9
2   tt0027256   Male      8
3   tt0028217   Male      7
4   tt0031580   Male     27
5   tt0033616   Male     46
6   tt0036077   Male     11
7   tt0038491   Male      7
8   tt0039654   Male      6
9   tt0040067   Male     10
True
CPU times: user 417 ms, sys: 32.5 ms, total: 450 ms
Wall time: 464 ms

In [39]:
%%time
def grader_5a(q5a):
    q5a_results  = pd.read_sql_query(q5a,conn)
    print(q5a_results.head(10))
    assert (q5a_results.shape == (4,2))
#For each year, count the number of movies in that year that had only female actors.
query5a = """WITH 
NON_FEMALE_MOVIES AS (SELECT TRIM(MC.MID) FROM M_Cast MC INNER JOIN Person P ON P.PID = TRIM(MC.PID) WHERE P.Gender in ('Male', NULL) GROUP BY MC.MID),
FEMALE_MOVIES AS (SELECT M.MID FROM Movie M INNER JOIN M_Cast MC ON TRIM(MC.MID) = M.MID WHERE TRIM(M.MID) NOT IN NON_FEMALE_MOVIES AND MC.PID NOTNULL GROUP BY M.MID)


SELECT M."year", COUNT(*) AS 'count'
FROM Movie M
WHERE TRIM(M.MID) IN FEMALE_MOVIES
GROUP BY M."year"
ORDER BY M."year" """
grader_5a(query5a)

     year  count
0    1939      1
1    1999      1
2    2000      1
3  I 2018      1
CPU times: user 276 ms, sys: 8.01 ms, total: 284 ms
Wall time: 287 ms

## Q5.b --- Now include a small change: report for each year the percentage of movies in that year with only female actors, and the total number of movies made that year. For example, one answer will be: 1990 31.81 13522 meaning that in 1990 there were 13,522 movies, and 31.81% had only female actors. You do not need to round your answer.

In [40]:
%%time
def grader_5b(q5b):
    q5b_results  = pd.read_sql_query(q5b,conn)
    print(q5b_results.head(10))
    assert (q5b_results.shape == (4,3))

query5b = """WITH 
NON_FEMALE_MOVIES AS (SELECT TRIM(MC.MID) FROM M_Cast MC INNER JOIN Person P ON P.PID = TRIM(MC.PID) WHERE P.Gender in ('Male', NULL) GROUP BY MC.MID),
FEMALE_MOVIES AS (SELECT M.MID FROM Movie M INNER JOIN M_Cast MC ON TRIM(MC.MID) = M.MID WHERE TRIM(M.MID) NOT IN NON_FEMALE_MOVIES AND MC.PID NOTNULL GROUP BY M.MID),
ALL_YEARS AS (SELECT M."year", COUNT(*) AS 'total_movies' FROM Movie as M GROUP BY M."year")

SELECT M."year", AY.total_movies, COUNT(M."year") * 100 / AY.total_movies AS percent
FROM Movie M
INNER JOIN FEMALE_MOVIES FM ON FM.MID = M.MID
INNER JOIN ALL_YEARS AY ON M."year" = AY."year"
GROUP BY M."year"
ORDER BY M."year" """
grader_5b(query5b)

     year  total_movies  percent
0    1939             2       50
1    1999            66        1
2    2000            64        1
3  I 2018            10       10
CPU times: user 280 ms, sys: 7.96 ms, total: 288 ms
Wall time: 291 ms

## Q6 --- Find the film(s) with the largest cast. Return the movie title and the size of the cast. By "cast size" we mean the number of distinct actors that played in that movie: if an actor played multiple roles, or if it simply occurs multiple times in casts, we still count her/him only once.

In [41]:
%%time
def grader_6(q6):
    q6_results  = pd.read_sql_query(q6,conn)
    print(q6_results.head(10))
    assert (q6_results.shape == (3473, 2))

query6 = """SELECT m.title Movie_Name, count(distinct(c.PID)) Cast_Size 
            FROM Movie m 
            JOIN M_Cast c
            ON c.MID = m.MID 
            GROUP BY m.MID 
            ORDER BY Cast_Size desc"""
grader_6(query6)

                   Movie_Name  Cast_Size
0               Ocean's Eight        238
1                    Apaharan        233
2                        Gold        215
3             My Name Is Khan        213
4  Captain America: Civil War        191
5                    Geostorm        170
6                     Striker        165
7                        2012        154
8                      Pixels        144
9       Yamla Pagla Deewana 2        140
CPU times: user 214 ms, sys: 43 ms, total: 257 ms
Wall time: 269 ms

### Q7 --- A decade is a sequence of 10 consecutive years. 
### For example, say in your database you have movie information starting from 1931. 
### the first decade is 1931, 1932, ..., 1940,
### the second decade is 1932, 1933, ..., 1941 and so on. 
### Find the decade D with the largest number of films and the total number of films in D

In [42]:
%%time
def grader_7a(q7a):
    q7a_results  = pd.read_sql_query(q7a,conn)
    print(q7a_results.head(10))
    assert (q7a_results.shape == (78, 2))

query7a = """WITH A AS (SELECT Y.YEAR AS MOVIE_YEAR, COUNT(*) AS TOTAL_MOVIES
             FROM (SELECT DISTINCT YEAR FROM MOVIE) Y JOIN MOVIE M
             ON M.YEAR >= Y.YEAR AND M.YEAR < Y.YEAR + 10
             GROUP BY 1
             ORDER BY COUNT(*))
             SELECT A.MOVIE_YEAR, COUNT(M.MID) AS TOTAL_MOVIES FROM MOVIE M
             INNER JOIN A ON A.MOVIE_YEAR = M.YEAR
             GROUP BY 1
             ORDER BY 1"""
grader_7a(query7a)

# using the above query, you can write the answer to the given question

  MOVIE_YEAR  TOTAL_MOVIES
0       1931             1
1       1936             3
2       1939             2
3       1941             1
4       1943             1
5       1946             2
6       1947             2
7       1948             3
8       1949             3
9       1950             2
CPU times: user 103 ms, sys: 2.89 ms, total: 106 ms
Wall time: 109 ms

In [43]:
%%time
def grader_7b(q7b):
    q7b_results  = pd.read_sql_query(q7b,conn)
    print(q7b_results.head(800))
    assert (q7b_results.shape == (713, 4))

query7b = """WITH QUERY AS (SELECT year as YEAR, COUNT(title) AS Total_Movies
                              FROM Movie
                              GROUP BY YEAR)
                              
            SELECT M.YEAR AS Movie_Year, M.Total_Movies, MV.YEAR AS Movie_Year, MV.Total_Movies AS Total_Movies
            FROM Query M, QUERY MV
            WHERE (MV.YEAR <= M.YEAR+9) AND (MV.YEAR >= M.YEAR)"""
grader_7b(query7b)
# if you see the below results the first movie year is less than 2nd movie year and 
# 2nd movie year is less or equal to the first movie year+9

# using the above query, you can write the answer to the given question

    Movie_Year  Total_Movies Movie_Year  Total_Movies
0         1931             1       1931             1
1         1931             1       1936             3
2         1931             1       1939             2
3         1936             3       1936             3
4         1936             3       1939             2
..         ...           ...        ...           ...
708       2016           118       2017           118
709       2016           118       2018            93
710       2017           118       2017           118
711       2017           118       2018            93
712       2018            93       2018            93

[713 rows x 4 columns]
CPU times: user 16.7 ms, sys: 3.87 ms, total: 20.6 ms
Wall time: 19.1 ms

In [44]:
%%time
def grader_7(q7):
    q7_results  = pd.read_sql_query(q7,conn)
    print(q7_results.head(10))
    assert (q7_results.shape == (1, 2))
#Write a query that will return the decade that has maximum number of movies
query7 = """SELECT dy.year as Decade_Start  , count(*) Number_of_movies \
                    FROM (SELECT DISTINCT year \
                          FROM movie \
                          WHERE year = CAST(SUBSTR(TRIM(year),-4) AS INTEGER) ) as dy \
                    JOIN movie ON movie.year >dy.year and movie.year <= dy.year + 9 \
                    WHERE movie.year = CAST(SUBSTR(TRIM(movie.year),-4) AS INTEGER)  \
                    GROUP BY dy.year ORDER BY count(*) desc \
                    LIMIT 1"""
grader_7(query7)
# if you check the output we are printinng all the year in that decade, its fine you can print 2008 or 2008-2017

  Decade_Start  Number_of_movies
0         2008              1023
CPU times: user 75.8 ms, sys: 2.64 ms, total: 78.4 ms
Wall time: 78.5 ms

## Q8 --- Find all the actors that made more movies with Yash Chopra than any other director.

In [45]:
%%time
def grader_8a(q8a):
    q8a_results  = pd.read_sql_query(q8a,conn)
    print(q8a_results.head(10))
    print(q8a_results.shape)
    assert (q8a_results.shape == (73408, 3))

query8a ="""SELECT DISTINCT trim(MC.PID) AS actor_id, MD.PID AS director_id, count(M.MID) AS Total_Movies
            FROM M_Cast MC
            JOIN M_Director MD
            ON MC.MID=MD.MID
            
            JOIN Movie M
            ON MC.MID= M.MID
            
            GROUP BY actor_id, director_id"""
grader_8a(query8a)

# using the above query, you can write the answer to the given question

    actor_id director_id  Total_Movies
0  nm0000002   nm0496746             1
1  nm0000027   nm0000180             1
2  nm0000039   nm0896533             1
3  nm0000042   nm0896533             1
4  nm0000047   nm0004292             1
5  nm0000073   nm0485943             1
6  nm0000076   nm0000229             1
7  nm0000092   nm0178997             1
8  nm0000093   nm0000269             1
9  nm0000096   nm0113819             1
(73408, 3)
CPU times: user 564 ms, sys: 36.8 ms, total: 601 ms
Wall time: 617 ms

In [46]:
%%time

def grader_8(q8):
    q8_results  = pd.read_sql_query(q8,conn)
    print(q8_results.head(10))
    print(q8_results.shape)
    assert (q8_results.shape == (245, 2))

query8 = """SELECT person.name , max_movie_count.Max_YC count \
          FROM ((SELECT ALLL.pid , MAX(ALLL.c) Max_ALL , YC.pid , MAX(YC.c) Max_YC \
                 FROM ((SELECT m_cast.pid , m_director.pid , count(*) c \
                        FROM movie  \
                        JOIN m_cast  \
                        ON movie.mid = m_cast.mid \
                        JOIN M_Director  \
                        ON movie.mid = m_director.mid \
                GROUP BY m_cast.pid, m_director.pid \
                ORDER BY count(*)  DESC ) as ALLL \
          JOIN \
          (SELECT m_cast.pid , m_director.pid , count(*) c \
           FROM movie  \
           JOIN m_cast  \
           ON movie.mid = m_cast.mid \
           JOIN m_director  \
           ON movie.mid = m_director.mid \
           WHERE m_director.pid  in (SELECT person.pid \
                            FROM person \
                            WHERE person.name LIKE '%Yash Chopra%' ) \
                            GROUP BY m_cast.pid, m_director.pid \
                            ORDER BY  count(*) DESC ) as YC \
          ON trim(ALLL.PID) = trim(YC.PID)) \
         GROUP BY ALLL.pid  \
         ORDER BY YC.c DESC ) as max_movie_count) , person \
                                                    WHERE max_movie_count.Max_YC >= max_movie_count.Max_ALL \
                                                    and trim(person.pid) = trim(max_movie_count.pid)"""

grader_8(query8)

                Name  count
0        Jagdish Raj     11
1   Manmohan Krishna     10
2           Iftekhar      9
3      Shashi Kapoor      7
4     Waheeda Rehman      5
5      Rakhee Gulzar      5
6        Neetu Singh      4
7     Achala Sachdev      4
8           Ravikant      4
9      Surendra Rahi      3
(245, 2)
CPU times: user 9.14 s, sys: 185 ms, total: 9.32 s
Wall time: 9.79 s

## Q9 --- The Shahrukh number of an actor is the length of the shortest path between the actor and Shahrukh Khan in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all actors who acted in the same film as Shahrukh have Shahrukh number 1; all actors who acted in the same film as some actor with Shahrukh number 1 have Shahrukh number 2, etc. Return all actors whose Shahrukh number is 2.

In [47]:
%%time
def grader_9a(q9a):
    q9a_results  = pd.read_sql_query(q9a,conn)
    print(q9a_results.head(10))
    print(q9a_results.shape)
    assert (q9a_results.shape == (2382, 1))

query9a = """WITH Query_one AS (SELECT P.PID
                             FROM Person P
                             WHERE P.name like '%Shah Rukh Khan'), 
                  
                  Query_two AS (SELECT MC.MID AS Movie_Name
                              FROM M_Cast MC
                              JOIN Movie M
                              ON MC.MID=M.MID
                              WHERE TRIM(MC.PID) IN Query_one)
            
            SELECT DISTINCT TRIM(MC.PID) AS S1_Actors
            FROM M_Cast MC
            WHERE (MC.MID In Query_two) AND (TRIM(MC.PID) NOT IN Query_one)"""
grader_9a(query9a)
# using the above query, you can write the answer to the given question

# selecting actors who acted with srk (S1)
# selecting all movies where S1 actors acted, this forms S2 movies list
# selecting all actors who acted in S2 movies, this gives us S2 actors along with S1 actors
# removing S1 actors from the combined list of S1 & S2 actors, so that we get only S2 actors

   S1_Actors
0  nm0004418
1  nm1995953
2  nm2778261
3  nm0631373
4  nm0241935
5  nm0792116
6  nm1300111
7  nm0196375
8  nm1464837
9  nm2868019
(2382, 1)
CPU times: user 77.7 ms, sys: 7.28 ms, total: 85 ms
Wall time: 85.1 ms

In [48]:
%%time
def grader_9(q9):
    q9_results  = pd.read_sql_query(q9,conn)
    print(q9_results.head(10))
    print(q9_results.shape)
    assert (q9_results.shape == (25698, 1))

query9 = """SELECT person.name \
          FROM person \
          JOIN (SELECT DISTINCT m_cast.pid \
                FROM m_cast \
                WHERE m_cast.mid in (SELECT DISTINCT m_cast.mid \
                                     FROM m_cast \
                                     WHERE m_cast.pid in (SELECT DISTINCT m_cast.pid \
                                                          FROM m_cast \
                                                          WHERE trim(m_cast.mid) in (SELECT m_cast.mid \
                                                                                       FROM m_cast \
                                                                                       WHERE trim(m_cast.pid) = (SELECT person.pid \
                                                                                                                 FROM person \
                                                                                                                 WHERE person.name like '%Shah Rukh Khan%' and person.pid = trim(pid)) \
                                                                                                                 and m_cast.mid = trim(m_cast.mid) \
                                                                                         ) \
                                                             ) ) and m_cast.pid not in (SELECT DISTINCT m_cast.pid \
                                                                                        FROM m_cast \
                                                                                        WHERE trim(m_cast.mid) in (select m_cast.mid \
                                                                                        FROM m_cast \
                                                                                        WHERE trim(m_cast.pid) = (SELECT person.pid \
                                                                                                                  FROM person where person.name like '%Shah Rukh Khan%' \
                                                                                                                                    and person.pid = trim(pid)) and m_cast.mid = trim(m_cast.mid) \
                      ))) as PIDS ON person.pid = trim(PIDS.pid)"""
grader_9(query9)

                    Name
0        Alicia Vikander
1           Dominic West
2         Walton Goggins
3              Daniel Wu
4   Kristin Scott Thomas
5           Derek Jacobi
6     Alexandre Willaume
7           Tamer Burjaq
8         Adrian Collins
9         Keenan Arrison
(25698, 1)
CPU times: user 423 ms, sys: 18 ms, total: 441 ms
Wall time: 454 ms